#include "headfile.h"
#include "beep.h"


/*---------------------------------------------------------------
 【函    数】Beep_Init
 【功    能】蜂鸣器初始化
 【参    数】无
 【返 回 值】无
 【注意事项】2022/04/13
 ----------------------------------------------------------------*/
void Beep_Init(void)
{
    //按键初始化
        gpio_init(BEEP,GPO,0,PULLUP);
}

/*---------------------------------------------------------------
 【函    数】Beep_ing
 【功    能】蜂鸣器初始化
 【参    数】无
 【返 回 值】无
 【注意事项】2022/04/13
 ----------------------------------------------------------------*/
void Beep_ing(void)
{
   // gpio_toggle(BEEP);
    gpio_set(BEEP, GPIO_HIGH);
    systick_delay_ms(STM0, 20);
    gpio_set(BEEP, 0);
//    gpio_toggle(BEEP);
}










